cavity_100/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.5;

vertices
(
    (0 0 0) // 0
    (1 0 0) // 1
    (2 0 0) // 2
    (2 1 0) // 3
    (1 1 0) // 4
    (0 1 0) // 5
    (0 0 0.1) // 6
    (1 0 0.1) // 7
    (2 0 0.1) // 8 
    (2 1 0.1) // 9
    (1 1 0.1) // 10 
    (0 1 0.1) // 11
    (0 -1 0) // 12
    (1 -1 0) // 13
    (2 -1 0) // 14
    (0 -1 0.1) // 15
    (1 -1 0.1) // 16
    (2 -1 0.1) // 17
);

blocks
(
    hex (0 1 4 5 6 7 10 11) (100 100 1) simpleGrading (5 0.2 1)
    hex (1 2 3 4 7 8 9 10) (100 100 1) simpleGrading (0.2 0.2 1)
    hex (12 13 1 0 15 16 7 6) (100 100 1) simpleGrading (5 5 1)
    hex (13 14 2 1 16 17 8 7) (100 100 1) simpleGrading (0.2 5 1)
);

edges
(
);

boundary
(
    topWall
    {
        type wall;
        faces
        (
            (5 11 10 4)
	    (4 10 9 3)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 6 11 5)
            (0 12 15 6)
	    (12 13 16 15)
	    (13 14 17 16)
            (2 8 17 14)
	    (2 3 9 8)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 5 4 1)
            (11 6 7 10)
	    (10 7 8 9)
	    (4 3 2 1)
	    (0 1 13 12)
            (1 2 14 13)
            (16 17 8 7)
	    (15 16 7 6)
        );
    }
);


// ************************************************************************* //
